; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v5 - type_2 ?v4 - type_1)
 	      (pred_4 ?v8 - object ?v4 - type_1)
	      (pred_2 ?v5 - type_2 ?v3 - type_3)
	      (pred_1 ?v5 - type_2 ?v8 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v5 - type_2 ?v6 ?v1 - type_1)
       :precondition (and  (pred_3 ?v5 ?v6))
       :effect (and  (pred_3 ?v5 ?v1)
		     (not (pred_3 ?v5 ?v6))))

   (:action op_1
       :parameters (?v5 - type_2 ?v2 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v7) (pred_3 ?v5 ?v7) (pred_2 ?v5 ?v3))
       :effect (and (pred_1 ?v5 ?v2 ?v3)
		    (not (pred_4 ?v2 ?v7)) 
		    (not (pred_2 ?v5 ?v3))))

   (:action op_2
       :parameters (?v5 - type_2 ?v2 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v2 ?v3) (pred_3 ?v5 ?v7))
       :effect (and (pred_4 ?v2 ?v7)
		    (pred_2 ?v5 ?v3)
		    (not (pred_1 ?v5 ?v2 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_02 - type_2
obj_08 obj_10 obj_12 obj_09 - type_3
obj_07 obj_05 obj_04 obj_06 - type_1
obj_01 obj_13 obj_03 - object)
(:init
(pred_3 obj_11 obj_07)
(pred_2 obj_11 obj_08)
(pred_2 obj_11 obj_10)
(pred_3 obj_02 obj_07)
(pred_2 obj_02 obj_12)
(pred_2 obj_02 obj_09)
(pred_4 obj_01 obj_07)
(pred_4 obj_13 obj_04)
(pred_4 obj_03 obj_04)
)
(:goal
(and
(pred_4 obj_01 obj_07)
(pred_4 obj_13 obj_04)
(pred_4 obj_03 obj_07)
)
)

(:constraints
  (always (not (pred_3 obj_11 obj_04)))
)
)

; plan
1. (op_3 obj_02 obj_07 obj_04)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_04)
   goals met: 2 of 3
2. (op_1 obj_02 obj_03 obj_04 obj_09)
   deleted: (pred_4 obj_03 obj_04) (pred_2 obj_02 obj_09)
   added: (pred_1 obj_02 obj_03 obj_09)
   goals met: 2 of 3
3. (op_3 obj_02 obj_04 obj_07)
   deleted: (pred_3 obj_02 obj_04)
   added: (pred_3 obj_02 obj_07)
   goals met: 2 of 3
4. (op_2 obj_02 obj_03 obj_07 obj_09)
   deleted: (pred_1 obj_02 obj_03 obj_09)
   added: (pred_4 obj_03 obj_07) (pred_2 obj_02 obj_09)
   goals met: 3 of 3
